In [1]:
import numpy as np
import pandas as pd

In [9]:
dict1 = {
    "name":["kashif", "atif", "naveed", "raheel"],
    "marks":[90,80,70,60],
    "city":["karachi", "Lahore", "Islamabad", "Multan"]
}

In [10]:
df = pd.DataFrame(dict1)

In [11]:
df

     name  marks       city
0  kashif     90    karachi
1    atif     80     Lahore
2  naveed     70  Islamabad
3  raheel     60     Multan